Infineon/AURIX_code_examples/code_examples/iLLD_TC387_ADS_GTM_TOM_3_Phase_Inverter_PWM_2/Libraries/Infra/Sfr/TC38x/IfxDam_bf.h
/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN13 */
#define IFX_DAM_RGNACCEN_RA_EN13_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN13 */
#define IFX_DAM_RGNACCEN_RA_EN13_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN13 */
#define IFX_DAM_RGNACCEN_RA_EN13_OFF (13u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN14 */
#define IFX_DAM_RGNACCEN_RA_EN14_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN14 */
#define IFX_DAM_RGNACCEN_RA_EN14_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN14 */
#define IFX_DAM_RGNACCEN_RA_EN14_OFF (14u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN15 */
#define IFX_DAM_RGNACCEN_RA_EN15_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN15 */
#define IFX_DAM_RGNACCEN_RA_EN15_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN15 */
#define IFX_DAM_RGNACCEN_RA_EN15_OFF (15u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN16 */
#define IFX_DAM_RGNACCEN_RA_EN16_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN16 */
#define IFX_DAM_RGNACCEN_RA_EN16_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN16 */
#define IFX_DAM_RGNACCEN_RA_EN16_OFF (16u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN17 */
#define IFX_DAM_RGNACCEN_RA_EN17_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN17 */
#define IFX_DAM_RGNACCEN_RA_EN17_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN17 */
#define IFX_DAM_RGNACCEN_RA_EN17_OFF (17u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN18 */
#define IFX_DAM_RGNACCEN_RA_EN18_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN18 */
#define IFX_DAM_RGNACCEN_RA_EN18_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN18 */
#define IFX_DAM_RGNACCEN_RA_EN18_OFF (18u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN19 */
#define IFX_DAM_RGNACCEN_RA_EN19_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN19 */
#define IFX_DAM_RGNACCEN_RA_EN19_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN19 */
#define IFX_DAM_RGNACCEN_RA_EN19_OFF (19u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN20 */
#define IFX_DAM_RGNACCEN_RA_EN20_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN20 */
#define IFX_DAM_RGNACCEN_RA_EN20_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN20 */
#define IFX_DAM_RGNACCEN_RA_EN20_OFF (20u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN21 */
#define IFX_DAM_RGNACCEN_RA_EN21_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN21 */
#define IFX_DAM_RGNACCEN_RA_EN21_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN21 */
#define IFX_DAM_RGNACCEN_RA_EN21_OFF (21u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN22 */
#define IFX_DAM_RGNACCEN_RA_EN22_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN22 */
#define IFX_DAM_RGNACCEN_RA_EN22_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN22 */
#define IFX_DAM_RGNACCEN_RA_EN22_OFF (22u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN23 */
#define IFX_DAM_RGNACCEN_RA_EN23_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN23 */
#define IFX_DAM_RGNACCEN_RA_EN23_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN23 */
#define IFX_DAM_RGNACCEN_RA_EN23_OFF (23u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN24 */
#define IFX_DAM_RGNACCEN_RA_EN24_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN24 */
#define IFX_DAM_RGNACCEN_RA_EN24_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN24 */
#define IFX_DAM_RGNACCEN_RA_EN24_OFF (24u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN25 */
#define IFX_DAM_RGNACCEN_RA_EN25_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN25 */
#define IFX_DAM_RGNACCEN_RA_EN25_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN25 */
#define IFX_DAM_RGNACCEN_RA_EN25_OFF (25u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN26 */
#define IFX_DAM_RGNACCEN_RA_EN26_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN26 */
#define IFX_DAM_RGNACCEN_RA_EN26_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN26 */
#define IFX_DAM_RGNACCEN_RA_EN26_OFF (26u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN27 */
#define IFX_DAM_RGNACCEN_RA_EN27_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN27 */
#define IFX_DAM_RGNACCEN_RA_EN27_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN27 */
#define IFX_DAM_RGNACCEN_RA_EN27_OFF (27u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN28 */
#define IFX_DAM_RGNACCEN_RA_EN28_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN28 */
#define IFX_DAM_RGNACCEN_RA_EN28_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN28 */
#define IFX_DAM_RGNACCEN_RA_EN28_OFF (28u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN29 */
#define IFX_DAM_RGNACCEN_RA_EN29_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN29 */
#define IFX_DAM_RGNACCEN_RA_EN29_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN29 */
#define IFX_DAM_RGNACCEN_RA_EN29_OFF (29u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN30 */
#define IFX_DAM_RGNACCEN_RA_EN30_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN30 */
#define IFX_DAM_RGNACCEN_RA_EN30_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN30 */
#define IFX_DAM_RGNACCEN_RA_EN30_OFF (30u)

/** \brief Length for Ifx_DAM_RGNACCEN_RA_Bits.EN31 */
#define IFX_DAM_RGNACCEN_RA_EN31_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RA_Bits.EN31 */
#define IFX_DAM_RGNACCEN_RA_EN31_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RA_Bits.EN31 */
#define IFX_DAM_RGNACCEN_RA_EN31_OFF (31u)

/** \brief Length for Ifx_DAM_RGNACCEN_RB_Bits.EN32 */
#define IFX_DAM_RGNACCEN_RB_EN32_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RB_Bits.EN32 */
#define IFX_DAM_RGNACCEN_RB_EN32_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RB_Bits.EN32 */
#define IFX_DAM_RGNACCEN_RB_EN32_OFF (0u)

/** \brief Length for Ifx_DAM_RGNACCEN_RB_Bits.EN33 */
#define IFX_DAM_RGNACCEN_RB_EN33_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RB_Bits.EN33 */
#define IFX_DAM_RGNACCEN_RB_EN33_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RB_Bits.EN33 */
#define IFX_DAM_RGNACCEN_RB_EN33_OFF (1u)

/** \brief Length for Ifx_DAM_RGNACCEN_RB_Bits.EN34 */
#define IFX_DAM_RGNACCEN_RB_EN34_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RB_Bits.EN34 */
#define IFX_DAM_RGNACCEN_RB_EN34_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RB_Bits.EN34 */
#define IFX_DAM_RGNACCEN_RB_EN34_OFF (2u)

/** \brief Length for Ifx_DAM_RGNACCEN_RB_Bits.EN35 */
#define IFX_DAM_RGNACCEN_RB_EN35_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RB_Bits.EN35 */
#define IFX_DAM_RGNACCEN_RB_EN35_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RB_Bits.EN35 */
#define IFX_DAM_RGNACCEN_RB_EN35_OFF (3u)

/** \brief Length for Ifx_DAM_RGNACCEN_RB_Bits.EN36 */
#define IFX_DAM_RGNACCEN_RB_EN36_LEN (1u)

/** \brief Mask for Ifx_DAM_RGNACCEN_RB_Bits.EN36 */
#define IFX_DAM_RGNACCEN_RB_EN36_MSK (0x1u)

/** \brief Offset for Ifx_DAM_RGNACCEN_RB_Bits.EN36 */
#define IFX_DAM_RGNACCEN_RB_EN36_OFF (4u)

